1. 请写1个支付宝接龙红包程序.
   随机产生1-100的随机数,作为红包金额.
   让用户不断的去猜,直到猜正确为止.最后发给用户的红包金额是 红包金额/猜得次数.

2. 循环录入5个人的年龄并计算平均年龄,如果录入的数据出现负数或大于100的数,立即停止输入并报错.

3. 实现要求用户一直输入QQ号码和密码，只要不是123456、888888就一直提示要求重新输入,如果正确则提登录成功.

4. 1-100之间不能够被7整除的数的和.

5. 求1-200之间的所有的整数的累加和

6. 求1-100之间6的倍数的个数

7. 输入班级人数,然后依次输入学员成绩，计算班级学员的平均成绩和总成绩

8. 2006年培养学员80000人，每年增长25%，请问按此增长速度，到哪一年培训学员人数将达到20万人？***

9.  从键盘输入10个数,求出最大数

10. 1000~ 5000之间有多少整数，其各位数字之和为5，分别是哪些数（例如整数2003的各位数字之和为 2+0+0+3 ，等于5）），
    并统计满足条件的整数有多少个。

11. 求1-100中 是7的倍数 的数值之和

12. 求1-1000之间的所有的奇数之和

13.猜数字游戏.  随机产生1个1-100之间的数 让用户猜
   当用户输入的数比产生的随机数大 就输出 猜大了 并让用户继续输入新的数.。
   当用户输入的比产生的随机数小的时候 就输出 猜小了 并且继续猜
   当用户刚好输入的就是这个随机数的时候 提示成功  并显示用户猜了多少次.


14. 老师问学生,这道题你会做了吗?
    如果学生答"会了(y)",则可以放学.
    如果学生不会做(n),则老师再讲一遍,再问学生是否会做了......直到学生会为止,才可以放学.
    直到学生会或老师给他讲了10遍还不会,都要放学

15.  写1个程序. 随机的产生1个2位数的加法运算.让用户输入这个运算的结果 然后判断这个结果是否正确.
     来10次.
     每个人默认有10分.
     产生10个加法运算.操作数的范围在0-100之间. 每产生1个加法运算 就让用户输入结果.判断是否正确.
     当回答正确的时候就为用户加1分. 错误的时候就扣1分.
     当10道题目回答完毕之后 就显示用户得的分数. ***