1. 写1个函数 返回1个整型数组中的最大值.

2. 写1个函数 返回1个整型数组中的最小值.

3. 写1个函数 返回1个整型数组中的累积和.

4. 写1个函数 返回1个整型数组中的平均值.

5. 写1个函数 返回指定的数据在数组中的下标.
   比如:
   int arr[3] = {10,20,30,50};
   找出这个数组中指定的元素的下标. 数组只是举个例子,你需要通过参数让调用者传递进来.
   如果不存在这个数据则返回-1;

6. 写1个函数判断指定的元素是否在指定的数组中存在.


7. 完成选择排序的理解.

8. 写1个程序,接收输入班级的人数, 然后依次的输入每1个学员的成绩.
   将学员的成绩存储在数组之中.
   输入完毕之后, 显示总成绩和平均成绩.

   然后再去掉1个最高分和1个最低分, 再计算平均成绩.

9. 有1个整型数组,请自己设计算法将这个数组中的元素进行翻转(此题选作*****)
   比如: 有数组 int arr[5] = {10,11,3,45,6};
   将元素的值设置为翻转        {6,45,3,11,10}

10. 请用户输入10个整型的数,将其存储到数组之中. 然后将其逆序输出.


11. 请自己定义1个整型数组,对这个整型数组中的元素做如下操作.
    如果元素的值大于0 则为该元素的值加1
    如果元素的值小于0 则为该元素的值减1
    如果元素的值等于0 则什么都不做.

12.随机产生20个[10 , 50]的正整数存到数组中，并求数组中的所有元素最大值、最小值、平均值以及各元素之和。















